
# Minimal Set ---------------------------------

## Taps
tap "homebrew/cask-fonts"
#tap "drakew/corgi"
#tap "alexellis/homebrew-alexellis
"
## Binaries
brew "bash-completion"
brew "bat"
brew "exa"
# brew "expect"
# brew "corgi"
brew "ssh-copy-id"
# brew "git-lfs"
# brew "git-secret"
brew "the_silver_searcher"
brew "httpie"
brew "wget"
# brew "mosh"
# brew "micro"
brew "jq"
brew "broot"
# brew "nnn"
# brew "bluetoothconnector"
brew "starship"

## Apps
cask "iterm2"
cask "alfred"
#cask "font-hack"
cask "font-hack-nerd-font"
cask "rectangle"

# Basic Applications ---------------------------------
# cask "cheatsheet"
cask "cakebrew"
cask "slack"
cask "authy"
cask "spotify"
cask "dynalist"
cask "appcleaner"
cask "google-chrome"
cask "cryptomator"
# cask "keybase"
cask "typora"

# Development ---------------------------------

## Binaries
brew "jenv"
brew "asdf"
# brew "nss" # needed by mkcert to configure Firefox
# brew "mkcert"
# brew "minica"

# sshpass 1.06
# brew "https://gist.githubusercontent.com/AnsonT/282d04ccfb70681f3851146e1e41a629/raw/184a30b25bf4e307b827991bbc7b6cca06f573ec/sshpass.rb"
# brew "coreutils"
# brew "gpg"
# brew "automake"
# brew "autoconf"
# brew "openssl"
# brew "libyaml"
# brew "readline"
# brew "libxslt"
# brew "libtool"
# brew "unixodbc"
# cask "qlcolorcode"
# cask "qlmarkdown"
# cask "quicklook-json"
# cask "qlstephen"
cask "syntax-highlight"

## Apps
cask "visual-studio-code"
cask "insomnia"
# cask "vagrant"

cask "imageoptim" # Optimize  images
# cask "sourcetree"
cask "gas-mask"   # Edit host files
# cask "dash"

cask "gitkraken"

cask "docker"
brew "kubernetes-cli"
brew "minikube"
# cask "kitematic"
cask "dotnet-sdk"
# cask "fastlane"

# brew "lazydocker"
# brew "dive"

# kubectx + kubens, https://github.com/ahmetb/kubectx
brew "kubectx"

# Multi pod and container log tailing for Kubernetes
brew "stern"

# Kubectl command line prompts
brew "c-bata/kube-prompt/kube-prompt"

# Kubernetes prompt
brew "kube-ps1"

# Terminal UI for Kubectl
brew "derailed/k9s/k9s"
