
# Minimal Set ---------------------------------

## Taps
tap "caskroom/cask"
tap "caskroom/fonts"

## Taps
tap "drakew/corgi"

## Binaries
brew "bash-completion"
brew "bat"
brew "exa"
brew "expect"
brew "corgi"
brew "ssh-copy-id"
brew "git-lfs"
brew "git-secret"
brew "the_silver_searcher"
brew "httpie"

## Apps
cask "iterm2"
cask "alfred"
cask "font-hack"
cask "spectacle"

# Basic Applications ---------------------------------
cask "cheatsheet"
cask "cakebrew"
cask "slack"
cask "authy"
cask "spotify"
cask "kitmatic"
cask "dynalist"
cask "appcleaner"
cask "google-chrome"
cask "cryptomator"
cask "keybase"

# Development ---------------------------------

## Binaries
brew "asdf"
brew "mkcert"
brew "minica"
# brew "coreutils"
# brew "gpg"
# brew "automake"
# brew "autoconf"
# brew "openssl"
# brew "libyaml"
# brew "readline"
# brew "libxslt"
# brew "libtool"
# brew "unixodbc"

## Apps
cask "visual-studio-code"
cask "insomnia"
cask "vagrant"

cask "dotnet-sdk"
cask "fastlane"
cask "imageoptim" # Optimize  images
cask "sourcetree"
cask "tower"      # git tower
cask "gas-mask"   # Edit host files
cask "dash"
cask "kitmatic"

cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlstephen"
